abbreviated
above
abstract
accent
accessibility
across
action
actions
activate
activity
adaptive
add
advanced
affinity
affordances
after
agent
agents
algebraic
aligned
alignment
all
allows
amend
analysis
analyzing
anchor
anchored
and
android
animate
animated
animation
animations
annotated
announcement
anti
any
anyone
anything
api
apothecary
app
apparatus
application
applications
applying
approach
aqua
arb
archetype
archetypes
architecting
architectural
architecture
archival
area
areas
argument
arguments
art
artwork
ask
assertions
asset
assets
assignments
asymmetry
asynchronous
atmospheric
attach
attractor
audit
auditing
aurora
austere
authoring
auto
automated
autoplay
available
avoid
awake
aware
axes
axis
background
backgrounds
bakery
band
bands
banned
banner
bans
bar
based
basic
because
before
behaviors
behind
belong
below
benefits
bento
bespoke
beyond
big
binaries
binding
bindings
black
blank
bleed
blob
block
blocked
blocks
blueprint
body
bool
boolean
border
botanical
bottom
bounce
bouncy
brand
break
breakpoint
breakpoints
bridge
bridging
brief
browser
brutal
brutalist
build
builder
building
built
bundle
burst
button
buttons
caf
callback
canon
canonical
card
cards
carnival
carousels
cascades
case
casting
catalog
catalogue
categories
category
ceiling
celebration
celebratory
centerpiece
centred
chaining
chamber
change
changed
character
check
checking
checklist
checks
child
chip
choice
choices
choosing
chrome
citrus
class
classes
clauses
cli
clich
clickable
client
clipboard
clipped
clipping
close
closed
cmdk
cobalt
cocoa
code
codebase
coffeebox
cold
collapse
collect
collection
color
colors
colour
column
combination
command
common
company
compilation
compile
compiler
compiling
complete
complex
compliance
component
components
compose
composition
comprehensive
compression
computation
concepts
concise
concrete
configuration
configure
configuring
confirm
confirmation
conflicts
console
constant
constraining
constraint
constraints
construct
constructing
construction
constructor
constructors
consume
containment
contains
content
contents
context
contract
contrast
contravariance
control
controller
conversational
cookbook
copy
core
correct
counter
coverage
cpp
craft
create
creating
credited
critical
critique
cropped
cross
css
cta
curated
cursor
curve
custom
customization
cut
cycle
dark
dart
dashes
data
day
deadliest
decide
decision
declarative
declaring
decoration
decorative
deep
default
defaults
define
defines
defining
delay
delegate
demo
dense
dependencies
dependency
depth
description
design
designs
desktop
destination
destroy
destructive
destructuring
detect
detection
device
diagnosis
diagnostic
diagnostics
diagram
dial
dialogs
did
differences
different
differs
diner
diptych
direct
direction
directives
disallows
discipline
disciplines
disclaimers
discovery
display
dispose
distribution
div
diversification
divider
dna
document
does
domain
don
dots
double
doubt
download
downloader
downloading
downloads
dpi
drag
drawn
driven
driver
drop
dropdown
dropdowns
drops
dtcg
durations
dynamic
dynamically
each
earns
easing
easings
ecosystem
edge
edges
editorial
eight
either
elastic
ellipsis
emission
emit
emits
emitting
emoji
emphasis
empty
enable
end
engine
engineer
english
enrichment
entry
entrypoint
environment
equality
equals
error
errors
every
everything
everywhere
example
examples
executable
executing
execution
exhaustive
exhaustiveness
exp
expect
expectations
explicit
exploration
export
expression
expressions
extension
extensions
extracting
extraction
eyeball
eyebrow
fabricated
faces
fade
failures
fall
family
faq
favicon
feature
features
feedback
fetch
fetching
ffi
ffigen
fidelity
field
fields
filament
file
files
fingerprint
fingerprints
fintech
first
fits
five
fixes
fixing
fixtures
flash
flex
flight
flips
float
floating
flourish
flow
fluid
flutter
focus
fold
follow
follower
font
footage
footer
footers
for
forbidden
fork
form
format
formats
formatting
forms
formulate
forui
foundation
foundry
four
frame
framed
frames
free
freedom
friends
from
full
functions
fundamentals
futures
gate
gates
gboolean
gchar
generate
generated
generating
generation
generative
generator
generic
genre
get
gets
ghost
glassmorphism
glow
grade
gradient
gradients
gradle
grain
graph
greys
grid
grids
ground
gsap
gtk
guard
guidelines
hairline
hallmark
hand
handle
handler
handling
hanging
hard
has
hash
hashes
have
having
headed
header
headers
heading
headings
headline
heads
height
heights
helper
helpers
hero
heroes
hidden
hierarchy
high
highest
highlight
hint
hit
hold
home
honest
hook
hooks
host
hosted
hover
how
hue
huge
hum
hwnd
hyphen
icon
icons
identical
identify
igen
ignore
illustration
illustrations
image
imagery
images
implement
implementation
implementations
implementing
implicit
import
improvisation
incremental
independent
index
indicator
industrial
init
initialization
initialize
initializer
initializing
ink
inline
inner
input
instance
instead
instrument
int
integration
inter
interacting
interaction
interactive
internationalisation
internationalizing
interop
into
introduction
invented
inverted
issues
italic
italics
item
its
job
json
junk
keeps
key
keyframes
kill
kit
knobs
know
kts
label
labels
landmark
language
large
last
late
launch
launcher
laws
layer
layered
layers
layout
layouts
lazy
lcov
lcp
leaf
led
left
length
lerp
letter
leverage
levers
lib
libraries
library
light
limitations
limits
line
lines
link
linked
linker
linking
links
lint
linux
list
llm
load
loaded
loading
loaf
local
localization
localized
lockfile
log
logic
logical
logo
logos
long
longer
look
looks
lookup
loop
loops
lottie
lowercase
lparam
lresult
lumen
luxury
mac
macrostructure
macrostructures
made
main
major
make
management
managing
mandatory
manifest
manifesto
manual
manually
map
mapping
margin
marginalia
mark
marquee
mascot
maskable
mast
masterclass
masthead
match
matcher
matchers
matches
matching
material
mcp
measurement
media
meet
mega
memory
menu
message
messages
meter
method
metrics
micro
microcopy
microinteraction
microinteractions
mid
midjourney
migrating
mini
minimal
minor
mismatched
mistakes
mobile
mock
mocked
mocking
mockito
mocks
mockup
mockups
modal
modals
mode
model
modern
moment
mono
morph
mossroot
motion
move
moves
much
multi
must
mutation
muted
name
named
names
nanobanana
narrative
native
nav
navigation
need
needed
negotiable
negotiables
neighbouring
nest
nested
network
networking
never
new
newsletter
newspaper
nib
night
non
not
notification
now
null
nullable
number
numbered
numeral
numerals
numeric
nums
object
off
offer
offline
once
one
only
opacity
open
opening
operations
operator
opt
optimistic
optimizing
optional
options
orb
orchestration
orientation
out
outlier
outlined
output
outputs
over
overflow
overlay
overlays
overrides
overriding
overshoot
overview
own
package
packages
padded
page
pair
pairing
palette
panel
paper
parameter
parameters
parent
park
parsing
part
party
pass
paths
pattern
patterns
pause
payload
per
perf
performance
periods
permissions
photographic
photography
phrase
phrases
pick
picking
picks
pill
pinned
pipeline
pitfall
pitfalls
pixel
placeholder
placeholders
placement
plain
plan
platform
player
playful
playground
playlist
plugin
plugins
plurals
point
pointer
polish
popovers
portable
portfolio
pre
precompiled
prefer
prerequisite
presentation
press
pressroom
preview
previewing
previews
primary
principles
prism
proc
process
produce
product
profiling
programmatic
progress
project
prompting
proof
proper
properties
property
protocol
ptr
pubspec
pull
pure
purple
purpose
quality
queries
question
questions
quick
quit
quote
quotes
radius
rail
ranges
raw
reacting
read
readability
reading
reads
ready
reason
recipe
recipes
recommended
recraft
rect
redesign
reduced
refactoring
reference
refusal
refuse
refuses
reg
register
registered
registrant
registrar
registry
regular
rejection
related
release
remote
removal
render
replacements
replacing
report
reports
repository
request
required
requirements
resolution
resolving
resort
resource
response
responsive
responsiveness
restated
restating
restorable
restriction
restrictions
retract
retracting
reveal
reveals
reversible
rhythm
rings
riot
rive
rollback
root
rotating
rotation
rounded
route
router
routes
routing
row
rule
rules
ruleset
run
runner
running
runtime
saa
saas
safe
safety
same
sameness
samples
sandbox
scaffold
scale
scaling
scan
scene
scope
scoping
screen
screens
screenshot
script
scripts
scroll
sealed
search
section
secure
select
selected
selection
selects
self
semantics
semicolon
senior
sequence
serializable
serializing
serif
service
set
sets
settings
setup
seven
shadcn
shaders
shadow
shadowing
shaking
shape
shared
sheet
shell
shift
ship
ships
short
shortcut
shorthand
should
show
shutdown
side
sidebar
sign
signals
signature
signups
simple
single
six
size
sizing
skill
skips
slab
slop
small
snap
soft
sound
soundness
source
sourcing
space
spacing
spec
specific
specifically
specifications
specimen
spectrum
spell
spinners
split
spotlight
sqlite
src
stack
stamp
standard
star
start
startup
stat
state
stateful
stateless
statement
statements
states
static
step
sticky
still
stills
straight
strategies
strategy
streak
streams
strict
string
strings
strip
stripe
stripping
structural
structure
structured
structuring
studied
studio
study
style
subprocesses
subtle
success
suggested
suite
support
supporting
supports
suppression
surface
surgical
svg
swapping
swift
switch
synchronous
syntax
system
tab
table
tables
tabular
tail
tailwind
target
targets
task
taste
taxonomy
technical
techniques
tells
template
terminal
terminate
test
testability
testimonials
testing
tests
text
texture
than
that
the
theme
themes
then
these
third
this
three
through
throws
tick
tier
tight
tightening
tighter
tightly
tile
time
timing
title
toast
toasts
toggles
token
tokens
tone
tool
toolchains
toolkit
tooltip
tooltips
topology
touch
transformation
transition
transitions
treatment
tree
trigger
triggered
triggers
trio
troubleshooting
truth
two
type
types
typographic
typography
uint
unbounded
undo
unique
unit
units
universal
unregister
until
update
upgrading
url
usage
use
user
using
utf
utils
validate
validation
value
variable
variables
variation
variations
variety
vector
verb
verification
verify
version
vertical
via
video
view
viewport
violation
visual
voice
void
wall
wash
wchar
web
weights
what
when
where
which
white
whole
why
widget
widgets
width
widths
win
window
windows
with
within
without
wnd
wordmark
workbench
worked
workflow
workflows
worth
would
wparam
wrap
wraps
write
writing
written
wstring
yaml
you
your
与交互
代码规范
完成标准
工作流程
平台能力
当前项目基线
技术选型规则
播放器领域约定
测试要求
目标架构
错误处理与日志
项目目标